---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryAreaRestraintX
source: html/d2dd729b-2b59-b0bf-2632-3bfa5325a310.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryAreaRestraintX Property

"X Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryAreaRestraintX { get; }
```